<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports GlobalProtect into munki.</string>
	<key>Identifier</key>
	<string>com.github.cospit.munki.GlobalProtect</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>GlobalProtect</string>
		<key>MUNKI_REPO_SUBDIR</key>
        	<string>apps/PaloAlto</string>
		<key>PLATFORM</key>
		<string>mac</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.cospit.munki.GlobalProtect</string>
        <key>DOWNLOAD_URL</key>
        <string>https://gp1.southperth.wa.gov.au/global-protect/getmsi.esp?platform=%PLATFORM%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>GlobalProtect delivers the protection of next-generation security platform to the mobile workforce in order to stop targeted cyberattacks, evasive application traffic, phishing, malicious websites, command-and-control traffic, and known and unknown threats.</string>
			<key>developer</key>
			<string>PaloAlto</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.cospit.download.GlobalProtect</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/gp.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Contents</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
                <dict>
                        <key>Arguments</key>
                                <dict>
                                        <key>additional_pkginfo</key>
                                        <dict>
                                                <key>version</key>
                                                <string>%version%</string>
                                        </dict>
                                </dict>
                        <key>Processor</key>
                        <string>MunkiPkginfoMerger</string>
                </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
