<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest Network Share Mounter App disk image and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.cospit.munki.networkShareMounter</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Network Share Mounter</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/faumac</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Network Share Mounter is a utility for MacOS to Mount SMB Network Shares easily at login, It also gives the end user the ability to reconnect the drive in the event it doesn't mount correctly the first time.</string>
            <key>display_name</key>
            <string>Network Share Mounter</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>ParentRecipe</key>
    <string>com.github.cospit.download.networkShareMounter</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
